/*
Navicat MySQL Data Transfer

Source Server         : wes
Source Server Version : 50543
Source Host           : localhost:3306
Source Database       : mypet

Target Server Type    : MYSQL
Target Server Version : 50543
File Encoding         : 65001

Date: 2021-04-28 11:10:05
*/

SET FOREIGN_KEY_CHECKS=0;
-- ----------------------------
-- Table structure for `activity`
-- ----------------------------
DROP TABLE IF EXISTS `activity`;
CREATE TABLE `activity` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `title` varchar(250) DEFAULT NULL COMMENT '主题',
  `event` varchar(250) DEFAULT NULL COMMENT '发生的事件',
  `times` date DEFAULT NULL COMMENT '活动时间',
  `address` varchar(200) DEFAULT NULL COMMENT '活动址地',
  `is_deleted` int(11) DEFAULT '0' COMMENT '逻辑删除',
  `gmt_create` datetime DEFAULT NULL COMMENT '创建时间',
  `gmt_modified` datetime DEFAULT NULL COMMENT '修改时间',
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=13 DEFAULT CHARSET=gb2312;

-- ----------------------------
-- Records of activity
-- ----------------------------
INSERT INTO `activity` VALUES ('1', '外出郊游', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2021-03-05', '河南省郑州市登封市的中岳嵩山', '0', '2021-03-13 23:26:36', '2021-03-06 23:26:41');
INSERT INTO `activity` VALUES ('2', '外出郊游', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2021-02-12', '山东省泰安市泰山区的东岳泰山', '0', '2021-03-11 23:27:30', '2021-03-11 23:27:33');
INSERT INTO `activity` VALUES ('3', '外出参观', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2020-12-11', '陕西省渭南市华阴市的西岳华山', '0', '2020-12-10 23:28:16', '2020-12-10 23:28:16');
INSERT INTO `activity` VALUES ('4', '外出郊游', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2020-09-03', '湖南省衡阳市南岳区的南岳衡山', '0', '2020-09-04 23:29:04', '2020-09-04 23:29:04');
INSERT INTO `activity` VALUES ('5', '外出郊游', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2020-10-21', '山西省大同市浑源县的北岳恒山', '0', '2020-10-22 23:30:06', '2020-10-22 23:30:06');
INSERT INTO `activity` VALUES ('6', '郊游参观', '郊游参观郊游参观郊游参观', '2020-03-09', '云台山', '0', '2021-03-22 13:06:38', '2021-03-22 13:49:48');
INSERT INTO `activity` VALUES ('7', '郊游', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2021-03-01', '北京天安门广场', '0', '2021-03-22 13:38:20', '2021-03-22 13:49:35');
INSERT INTO `activity` VALUES ('8', '参观', '组织活动，带流浪猫狗外出放松心情，呼吸新鲜空气。', '2021-03-01', '灵台山', '0', '2021-03-22 13:38:34', '2021-03-22 13:49:20');
INSERT INTO `activity` VALUES ('9', '交流会', '第13批好心宠物收养人集体聚会交流。', '2021-03-20', '十里长亭小公园', '0', '2021-02-05 13:46:04', '2021-03-22 13:46:41');
INSERT INTO `activity` VALUES ('10', '保护小动物', '去喂养流浪的猫狗', '2021-03-01', '江西省上饶市余干县', '0', '2021-03-22 13:47:46', '2021-03-22 13:48:31');
INSERT INTO `activity` VALUES ('11', '保护小动物', '去治疗路边的猫', '2021-02-28', '十里长亭小公园', '0', '2021-03-22 17:00:05', '2021-03-22 17:00:24');
INSERT INTO `activity` VALUES ('12', '保护小动物', '去收养路边的猫', '2021-03-08', '八里长亭小公园', '0', '2021-03-23 18:17:26', '2021-03-23 18:18:10');

-- ----------------------------
-- Table structure for `admin`
-- ----------------------------
DROP TABLE IF EXISTS `admin`;
CREATE TABLE `admin` (
  `id` int(50) NOT NULL AUTO_INCREMENT,
  `adminName` varchar(20) NOT NULL COMMENT '管理员的账户名',
  `adminPwd` varchar(20) NOT NULL COMMENT '密码',
  `realName` varchar(20) NOT NULL COMMENT '真实的名字',
  `telephone` varchar(20) DEFAULT NULL COMMENT '电话',
  `Email` varchar(50) DEFAULT NULL COMMENT '邮箱',
  `birthday` date DEFAULT NULL COMMENT '生日',
  `sex` int(3) DEFAULT NULL COMMENT '性别',
  `remark` varchar(255) DEFAULT NULL,
  `is_deleted` int(20) DEFAULT '0' COMMENT '逻辑删除',
  `gmt_create` datetime DEFAULT NULL COMMENT '创建时间',
  `gmt_modified` datetime DEFAULT NULL COMMENT '更改时间',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=26 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of admin
-- ----------------------------
INSERT INTO `admin` VALUES ('1', 'admin', '111111', '花千骨', '13912341234', 'huaqiangu@qq.com', '1999-09-08', '0', '花千骨，命格诡异的孤女，出生时身怀异香，易招惹魔徒，被长留上仙白子画所救，对其暗生情愫。', '0', '2021-01-16 10:59:13', '2021-03-16 14:29:34');
INSERT INTO `admin` VALUES ('2', 'admin1', '111111', '白子画', '15998966632', 'baizihua@qq.com020', '1990-09-08', '1', '这世上，怕是再无一画，可以装得下他的仙姿，他的容貌，他的风采，他的气质', '0', '2021-01-15 10:59:16', '2021-03-29 22:12:23');
INSERT INTO `admin` VALUES ('3', 'admin2', '111111', '霓漫天', '13698556523', 'nimantian@qq.com', '2021-01-17', '0', '霓漫天，霓漫天霓漫天霓漫天', '0', '2021-01-22 10:59:19', '2021-02-15 10:59:41');
INSERT INTO `admin` VALUES ('4', 'admin3', '111111', '笙箫默', '15966325632', 'shengxiaomo@qq.com', '2021-01-09', '1', '笙箫默，笙箫默，笙箫默，笙箫默，', '0', '2021-01-15 10:59:22', '2021-02-07 10:59:44');
INSERT INTO `admin` VALUES ('5', 'admin4', '111111', '落十三', '13789565523', 'luoshisan@qq.com', '2021-01-17', '1', '落十三，落十三落十三落十三落十三落十三', '0', '2021-01-01 10:59:24', '2021-02-05 10:59:51');
INSERT INTO `admin` VALUES ('6', 'bbb', '111111', '清虚', '13699856635', 'qingxu@qq.com', '2021-01-11', '1', '清虚道长，清虚道长，清虚道长，清虚道长，清虚道长，清虚道长，', '0', '2021-01-22 10:59:29', '2021-01-31 10:59:56');
INSERT INTO `admin` VALUES ('7', 'ccc', '111111', '杀阡陌', '15988565236', 'shaqianmo@qq.com', '2021-01-08', '0', '杀阡陌，杀阡陌，杀阡陌，杀阡陌，杀阡陌，', '0', '2021-01-29 10:59:33', '2021-01-30 11:00:01');
INSERT INTO `admin` VALUES ('8', 'ddd', '111111', '管理员1', '15998666366', '111@qq.com', '1996-03-04', '1', '管理员1管理员1', '0', '2021-02-11 17:23:21', '2021-02-11 17:23:21');
INSERT INTO `admin` VALUES ('9', 'eee', '111111', '管理员2', '15988695623', 'hjj@qq.com', '2021-02-04', '0', '管理员2管理员2', '0', '2021-02-11 17:23:28', '2021-02-11 17:23:28');
INSERT INTO `admin` VALUES ('10', 'fff', '111111', '管理员3', '15998566652', 'qwer@qq.com', '2021-03-09', '1', '管理员3管理员3', '1', '2021-02-11 17:23:33', '2021-02-11 17:23:33');
INSERT INTO `admin` VALUES ('11', 'abc', '111111', '管理员4', '18236998565', '55556@qq.com', '2018-03-05', '1', '管理员4管理员4', '0', '2020-06-20 17:23:37', '2021-03-30 13:01:42');
INSERT INTO `admin` VALUES ('12', 'aab', '111111', '管理员5', '18759655632', '555@qq.com', '1990-09-08', '0', '管理员5', '1', '2021-02-12 17:23:46', '2021-02-12 17:23:46');
INSERT INTO `admin` VALUES ('13', 'aac', '111111', '管理员6', '15896566641', '666@qq.com', '1991-09-08', '0', '管理员6', '1', '2021-01-09 17:23:52', '2021-01-09 17:23:52');
INSERT INTO `admin` VALUES ('14', 'aad', '111111', '管理员7', '15874123698', '777@qq.com', '1990-09-08', '0', '管理员7', '1', '2021-02-22 17:23:59', '2021-02-22 17:23:59');
INSERT INTO `admin` VALUES ('15', 'aae', '111111', '管理员8', '13789633312', '888@qq.com', '1990-09-08', '1', '管理员8', '1', '2021-02-04 17:24:04', '2021-02-04 17:24:04');
INSERT INTO `admin` VALUES ('16', 'bbc', '111111', '管理员9', '13256998563', '999@qq.com', '1990-09-08', '1', '管理员9', '1', '2020-06-27 17:24:09', '2020-06-27 17:24:09');
INSERT INTO `admin` VALUES ('17', 'bbd', '111111', '管理员10', '15998666323', 'zhangsan@qq.com', '1996-03-04', '1', '张三张三张三', '0', '2020-12-11 17:24:16', '2021-03-30 13:38:28');
INSERT INTO `admin` VALUES ('18', 'bbe', '111111', '管理员11', '15698856563', '1559859@qq.com', '2021-03-09', '1', '管理员11管理员11', '1', '2021-03-15 16:51:13', '2021-03-16 14:57:00');
INSERT INTO `admin` VALUES ('19', 'ccd', '222222', '管理员12', '15999889996', '4546@qq.com', '2021-03-16', '0', '管理员12管理员12', '1', '2021-03-15 16:53:52', '2021-03-16 14:48:32');
INSERT INTO `admin` VALUES ('20', 'cce', '111111', '管理员13', '15996854123', '131313@qq.com', '1990-09-08', '1', '管理员13管理员13', '0', '2021-03-16 14:55:27', '2021-03-16 14:55:27');
INSERT INTO `admin` VALUES ('21', 'ccf', '111111', '管理员14', '15713656693', '141414@qq.com', '1996-03-04', '0', '管理员14管理员14', '1', '2021-03-16 14:57:20', '2021-03-16 14:57:33');
INSERT INTO `admin` VALUES ('22', 'ccg', '111111', '管理员15', '18756966696', '151515@qq.com', '1996-03-04', '1', '管理员15管理员15', '1', '2021-03-16 14:57:50', '2021-03-16 14:57:57');
INSERT INTO `admin` VALUES ('23', 'dde', '222222', '管理员16', '15998556356', '154154@qq.com', '2021-03-09', '1', '管理员16管理员16', '1', '2021-03-17 13:56:56', '2021-03-17 13:57:37');
INSERT INTO `admin` VALUES ('24', 'ddf', '111111', '管理员17', '18233699963', '161616@qq.com', '1996-03-04', '0', '管理员17管理员17', '1', '2021-03-17 13:57:52', '2021-03-17 13:58:17');
INSERT INTO `admin` VALUES ('25', 'xxx', '222222', '管理员18', '15996332356', '1952@qq.com', '2021-03-09', '1', '管理员18管理员18', '1', '2021-03-23 18:13:51', '2021-03-23 18:16:58');

-- ----------------------------
-- Table structure for `blog`
-- ----------------------------
DROP TABLE IF EXISTS `blog`;
CREATE TABLE `blog` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `actionTime` date NOT NULL,
  `address` varchar(100) NOT NULL,
  `peoples` varchar(100) NOT NULL,
  `event` varchar(100) NOT NULL,
  `title` varchar(20) NOT NULL,
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=15 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of blog
-- ----------------------------
INSERT INTO `blog` VALUES ('1', '2020-04-07', '江西省宿迁市', '张三，李四，王五.', '自愿去春风小区对小区的动物进行检查和医疗', '保护小动物');
INSERT INTO `blog` VALUES ('2', '2020-04-07', '江西省宿迁市', '张三,王五', '自愿去春风小区对小区的动物进行检查和医疗', '保护小动物');
INSERT INTO `blog` VALUES ('3', '2020-04-07', '江西省宿迁市', '王二麻子,李四', '去收养路边的猫狗1', '保护小动物');
INSERT INTO `blog` VALUES ('4', '2020-04-07', '江西省宿迁市', '王二麻子,张三,李四', '去收养路边的猫', '保护小动物');
INSERT INTO `blog` VALUES ('5', '2020-04-07', '江西省宿迁市', '张三,李四', '去治疗路边的猫', '保护小动物');
INSERT INTO `blog` VALUES ('6', '2020-04-07', '江西省宿迁市', '张三,李四，王五', '去治疗路边的猫狗', '保护小动物');
INSERT INTO `blog` VALUES ('7', '2020-04-07', '江西省宿迁市', '王五', '去喂养流浪的猫狗', '保护小动物');
INSERT INTO `blog` VALUES ('8', '2020-04-07', '江西省宿迁市', '杨一', '去喂养流浪的猫狗', '保护小动物');
INSERT INTO `blog` VALUES ('10', '2020-04-07', '江西省上饶市余干县', '杨一,王二麻子', '去喂养流浪的猫狗', '保护小动物');
INSERT INTO `blog` VALUES ('14', '2020-04-07', '十里长亭小公园', '54', '第13批好心宠物收养人集体聚会交流。', '请大家准时参加啊');

-- ----------------------------
-- Table structure for `famous`
-- ----------------------------
DROP TABLE IF EXISTS `famous`;
CREATE TABLE `famous` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `petName` varchar(50) DEFAULT NULL,
  `remark` varchar(250) DEFAULT NULL,
  `pic` varchar(250) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=5 DEFAULT CHARSET=gb2312;

-- ----------------------------
-- Records of famous
-- ----------------------------
INSERT INTO `famous` VALUES ('1', '罗罗', '罗罗是一个非常乖巧、聪明可爱的小猫咪，曾连续两届获得救助站的最乖猫咪奖，她的乖巧令人心情愉悦，心旷神怡。', '/images/famous/luoluo.jpg');
INSERT INTO `famous` VALUES ('2', '小波', '小波是公认的救助站最美的猫咪，追求她的公猫数不胜数，尤其是她那清澈明亮的大蓝眼睛，是名副其实的站花。', '/images/famous/xiaobo.jpg');
INSERT INTO `famous` VALUES ('3', '霸王', '一听这名字可能想象出这只小狗是多么的霸气外漏，他是救助站动物们的保镖，深受其他小动物们的喜爱与追捧。', '/images/famous/bawang.jpg');
INSERT INTO `famous` VALUES ('4', '富贵', '富贵是一只非常聪明的狗，在各项狗狗智力训练的比赛中屡次获得第一，智商甚至超过三岁的小孩子。', '/images/famous/fugui.jpg');

-- ----------------------------
-- Table structure for `pet`
-- ----------------------------
DROP TABLE IF EXISTS `pet`;
CREATE TABLE `pet` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT '键主',
  `petName` varchar(20) NOT NULL COMMENT '宠物姓名',
  `petType` varchar(20) NOT NULL DEFAULT '1' COMMENT '宠物类型',
  `sex` int(3) DEFAULT '1' COMMENT '性别',
  `birthday` datetime DEFAULT NULL COMMENT '生日',
  `pic` varchar(200) DEFAULT NULL COMMENT '图片',
  `state` int(11) DEFAULT '1' COMMENT '现在的状态 0 没有申请领养 1 被申请领养 2 已经被领养',
  `uid` int(11) DEFAULT '0' COMMENT '主人，0，未被领养',
  `remark` varchar(255) DEFAULT NULL COMMENT '备注',
  `is_deleted` int(11) DEFAULT '0' COMMENT '逻辑删除',
  `gmt_create` datetime DEFAULT NULL COMMENT '创建时间',
  `gmt_modified` datetime DEFAULT NULL COMMENT '修改时间',
  `version` int(11) DEFAULT '0' COMMENT '乐观锁',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of pet
-- ----------------------------
INSERT INTO `pet` VALUES ('1', '淘气旺仔', '15', '1', '2020-03-22 00:00:00', '/images/animals/45905889-8ab7-4b21-acf6-0964d0a7361e_adoptcat1.jpg', '1', '2', '暹（xiān）罗猫是世界著名的短毛猫，也是短毛猫的代表品种。种族原产于暹罗（今泰国），故名暹罗猫。在200多年前，这种珍贵的猫仅在泰国的皇宫和大寺院中饲养，是足不出户的贵族。暹罗猫能够较好适应主人当地的气候，且性格刚烈好动，机智灵活。', '0', '2021-01-27 15:53:11', '2021-03-24 00:03:52', '0');
INSERT INTO `pet` VALUES ('2', '哈k', '8', '1', '2020-03-24 00:00:00', '/images/animals/d81549f5-d99e-4581-b619-7a4cca65a3c2_adoptdog3.jpg', '0', '0', '贵宾犬（Poodle），也称“贵妇犬”，又称“卷毛狗”，在德语中，Pudel是“水花飞溅”的意思，是犬亚科犬属的一种动物。贵宾犬的来源就像它为了拖出猎禽所涉过的水一样浑浊不清。', '0', '2021-01-27 15:53:37', '2021-03-20 17:23:31', '0');
INSERT INTO `pet` VALUES ('5', '辛巴', '25', '0', '2020-04-05 00:00:00', '/images/animals/ba43796c-f69a-413d-b814-aca6fce9baae_yingguoduanmaomao.jpg', '1', '3', '英国短毛猫，体形圆胖，四肢粗短发达，毛短而密，头大脸圆，温柔平静，对人友善，极易饲养。大而圆的眼睛根据被毛不同而呈现各种颜色。作为一个古老的猫品种，其历史可追溯至古罗马时期的家猫，由于拥有悠久的育种历史，可以称得上是猫家族中的典范。英国短毛猫除了拥有固定而聚，代表性的遗传特征之外，又具有丰富的变异性，如背毛色眼睛颜色等。', '0', '2021-01-27 15:53:43', '2021-03-20 17:32:35', '0');
INSERT INTO `pet` VALUES ('20', '凯丽', '19', '0', '2020-04-09 00:00:00', '/images/animals/adoptcat4.jpg', '0', '0', '雪鞋猫的形象中包含了很多不同的基因，譬如形成脸上的倒“V”字形斑纹和形成四肢斑纹的基因不是同一回事。斑纹的对称性是判断高品质雪鞋猫至关重要的特征，而斑纹不规整的个体也能成为很好的宠物。它们机灵，重感情，经常对水表现出特别的偏爱。就跟其祖先暹罗猫一样，雪鞋猫也是特别爱叫的品种。', '0', '2021-01-27 15:53:48', '2021-03-20 17:28:42', '0');
INSERT INTO `pet` VALUES ('21', '小傻', '7', '0', '2020-04-09 00:00:00', '/images/animals/f1e51cfb-55f1-4925-be16-c96727f64b16_jiwawa.jpg', '0', '0', '吉娃娃从墨西哥传到美国后到1898年的历史至今不清。有人确定此犬原产于南美，初期被印加族人视为神圣的犬种，后来传到阿斯提克族。也有人认为此犬是随西班牙的侵略者到达新世界的品种，或者在19世纪初期，从中国传入的。以上各种判断，可以说明此犬绝非源自一种品种，而是自古以来就是由多种品种交配而来的。', '0', '2021-01-27 15:53:53', '2021-03-21 13:50:59', '0');
INSERT INTO `pet` VALUES ('22', '富贵', '6', '1', '2020-04-02 00:00:00', '/images/animals/bf329273-57db-4840-9cc7-1b08ff969bf7_adoptdog1.jpg', '1', '30', '柴犬是体型中等并且又最古老的犬。柴犬能够应付陡峭的丘陵和山脉的斜坡，拥有灵敏的感官，使得柴犬屡次成为上乘的狩猎犬。柴犬性格活泼、好动。对自己喜欢的玩具、会一天到晚的把玩。其对外有极强警惕性，能为户主看家护院。', '0', '2021-01-27 15:53:59', '2021-03-20 17:31:07', '0');
INSERT INTO `pet` VALUES ('23', '阿杜', '12', '1', '2020-04-16 00:00:00', '/images/animals/80680e26-beef-43f7-ae80-dfed544d2db2_dupinquan.jpg', '0', '8', '杜宾犬是一种十分凶猛的犬种，主要担当军、警工作，经过训练后，可成为搜索犬、狩猎犬和牧羊犬。杜宾犬性格活泼、警惕、坚定、机敏、勇敢而顺从。另一方面，杜宾犬胆大而坚决，好撕咬，具备一定的攻击性。这些特点决定了它具备一条优秀警用犬的所有条件。杜宾犬的身体结构健壮而稳定，被毛平滑而又光泽，看上去非常完美', '0', '2021-01-16 17:02:42', '2021-03-20 17:32:54', '0');
INSERT INTO `pet` VALUES ('24', '小波', '17', '0', '2020-04-09 00:00:00', '/images/animals/adoptcat8.jpg', '0', '0', '波斯猫是以阿富汗的土种长毛猫和土耳其的安哥拉长毛猫为基础，在英国经过100多年的选种繁殖， 于1860年诞生的一个品种。波斯猫是最常见的长毛猫，波斯猫有一张讨人喜爱的面庞， 长而华丽的背毛，优雅的举止，故有“猫中王子”、“王妃”之称，是世界上爱猫者最喜欢的纯种猫之一，占有极其重要的地位', '0', '2021-01-17 17:02:46', '2021-03-20 17:25:43', '0');
INSERT INTO `pet` VALUES ('25', '小摩', '26', '1', '2021-01-27 00:00:00', '/images/animals/adoptcat9.jpg', '1', '31', '挪威森林猫（Norwegian Forest Cat），以白话直译的说法，就是在挪威森林里面栖息的，生存的猫，这是斯堪地半岛特有的品种，其起源不明，常常以像妖精的猫出现在北欧的神话之中。挪威森林猫外观与缅因猫相似，与西伯利亚森林猫同列。森林猫生长的环境非常寒冷和恶劣，因此它长有比其它猫更厚密的被毛和强壮的体格。挪威森林猫体大肢壮，奔跑速度极快，不怕日晒雨淋，行走时颈毛和尾毛飘逸，非常美丽。', '0', '2021-01-27 17:06:58', '2021-03-20 17:26:36', '0');
INSERT INTO `pet` VALUES ('26', '小五', '20', '1', '2021-01-27 00:00:00', '/images/animals/c9255f16-2e83-4d59-9f0c-e421225689f3_buoumao.jpg', '1', '32', '布偶猫是猫中较大、较重的一种。它的头呈V形，眼大而圆，被毛丰厚，四肢粗大，尾长，身体柔软，多为三色或双色猫。布偶猫抱起来像软绵绵的布偶，而且对人非常友善。它性格大胆，不知道什么叫恐惧，而且对疼痛的忍耐性相当强，常被误认为缺乏疼痛感，因此很能容忍孩子的玩弄，是非常理想的家庭宠物。', '0', '2021-01-27 17:07:31', '2021-03-20 17:34:06', '0');
INSERT INTO `pet` VALUES ('27', '大眼', '21', '0', '2021-01-27 17:07:47', '/images/animals/adoptcat12.jpg', '1', '33', '波斯猫是以阿富汗的土种长毛猫和土耳其的安哥拉长毛猫为基础，在英国经过100多年的选种繁殖， 于1860年诞生的一个品种。波斯猫是最常见的长毛猫，波斯猫有一张讨人喜爱的面庞， 长而华丽的背毛，优雅的举止，故有“猫中王子”、“王妃”之称，是世界上爱猫者最喜欢的纯种猫之一，占有极其重要的地位', '1', '2021-01-25 17:02:57', '2021-01-26 17:03:02', '0');
INSERT INTO `pet` VALUES ('28', '小博', '11', '1', '2021-03-08 00:00:00', '/images/animals/54d7f897-12a7-4990-91ef-76ee675596a3_bomeiquan.jpg', '1', '34', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '0', '2021-03-16 15:20:37', '2021-03-20 17:35:30', '0');
INSERT INTO `pet` VALUES ('29', '二哈', '9', '0', '2021-03-09 00:00:00', '/images/animals/8767dc37-fb7a-4952-807b-4bcee63d4707_adoptdog9.jpg', '1', '35', '西伯利亚雪橇犬，常见别名哈士奇，昵称为二哈。哈士奇名字是源自其独特的嘶哑叫声 [1]  。哈士奇性格多变，有的极端胆小，也有的极端暴力，进入人类社会和家庭的哈士奇，都已经没有了这种极端的性格，比较温顺，是一种流行于全球的宠物犬。', '0', '2021-03-16 15:22:28', '2021-03-20 17:36:49', '0');
INSERT INTO `pet` VALUES ('30', '小五', '11', '1', '2021-03-08 00:00:00', '/images/animals/adoptdog4.jpg', '1', '36', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-16 15:24:45', '2021-03-16 16:23:42', '0');
INSERT INTO `pet` VALUES ('31', '小六', '11', '0', '2021-03-02 00:00:00', '/images/animals/adoptdog5.jpg', '0', '0', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-16 16:12:04', '2021-03-16 16:23:31', '0');
INSERT INTO `pet` VALUES ('32', '小美5', '4', '1', '2021-03-15 00:00:00', '/images/animals/adoptdog6.jpg', '1', '37', '西伯利亚雪橇犬，常见别名哈士奇，昵称为二哈。哈士奇名字是源自其独特的嘶哑叫声 [1]  。哈士奇性格多变，有的极端胆小，也有的极端暴力，进入人类社会和家庭的哈士奇，都已经没有了这种极端的性格，比较温顺，是一种流行于全球的宠物犬。', '1', '2021-03-16 16:32:01', '2021-03-16 21:53:29', '0');
INSERT INTO `pet` VALUES ('33', '阿狸', '16', '0', '2021-03-15 00:00:00', '/images/animals/a1b8371e-ef1b-4433-ace8-27cadb55ee05_lihuamao.jpg', '0', '0', '狸花猫是一种体格健壮的大型猫咪，长有美丽的斑纹被毛。尽管它感情不太外露，但还是能成为忠实友好的宠物。狸花猫以聪明的捕猎技巧而著称，需要较大的运动空间，所以不适宜小公寓的圈养生活。', '0', '2021-03-16 21:53:48', '2021-03-20 17:38:28', '0');
INSERT INTO `pet` VALUES ('34', '小美4', '2', '1', '2021-03-17 00:00:00', '/images/animals/adoptdog8.jpg', '1', '38', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-17 13:37:52', '2021-03-17 13:54:42', '0');
INSERT INTO `pet` VALUES ('35', '小美3', '2', '0', '2021-03-15 00:00:00', '/images/animals/adoptdog9.jpg', '0', '0', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-17 13:54:52', '2021-03-20 17:45:53', '0');
INSERT INTO `pet` VALUES ('36', '小美2', '2', '1', '2021-03-01 00:00:00', '/images/animals/1419fe92-1a2b-474d-b95d-a964fa8ac487_bg.jpg', '1', '39', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-20 15:23:40', '2021-03-20 17:45:53', '0');
INSERT INTO `pet` VALUES ('37', '小美1', '3', '1', '2021-03-08 00:00:00', '/images/animals/1419fe92-1a2b-474d-b95d-a964fa8ac487_bg.jpg', '1', '42', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '0', '2021-03-20 15:27:34', '2021-03-20 17:00:53', '0');
INSERT INTO `pet` VALUES ('38', '小边3', '29', '1', '2021-03-08 00:00:00', '/images/animals/7c6a3caf-ebea-4f2c-afe2-ee8a802e1c9a_jianad.jpg', '0', '0', '加拿大无毛猫（Canadian Hairless）亦称斯芬克斯猫，是加拿大安大略省多伦多市养猫爱好者在1966年从一窝几乎是无毛的猫仔中，经过近交选育，特意为对猫毛过敏的爱猫者培育成的。这种猫是自然的基因突变产生的宠物猫，除了在耳、口、鼻、尾前段、脚等部位有些又薄又软的胎毛外，其它全身部分均无毛，皮肤多皱有弹性。加拿大无毛猫性情温顺，独立性强，无攻击性，能与其它猫狗相处', '0', '2021-03-20 16:00:31', '2021-03-20 17:39:28', '0');
INSERT INTO `pet` VALUES ('39', '小边2', '10', '0', '2021-03-02 00:00:00', '/images/animals/83aa2c7c-40ec-4dae-a3f0-00bff213a0a0_xuenarui.jpg', '0', '0', '雪纳瑞共有三个品种：大型、标准型、小型三种。 原产地为德国。体长等于身高，呈正方形体型。被毛浓密粗硬，毛色有黑色和胡椒色，脸部毛稍短。耳小呈V字形，向前边垂下。嘴边长有胡髭。眼大小适中，呈暗色。胸宽深，臀强硬，腹上收。前肢直立，后肢宽阔结实，断尾，擎起。', '0', '2021-03-20 16:04:19', '2021-03-20 17:40:41', '0');
INSERT INTO `pet` VALUES ('40', '小边1', '5', '0', '2021-03-01 00:00:00', '/images/animals/dedab93c-96cb-4d5a-a802-1c1d11af82e8_bg.jpg', '0', '0', '雪纳瑞共有三个品种：大型、标准型、小型三种。 原产地为德国。体长等于身高，呈正方形体型。被毛浓密粗硬，毛色有黑色和胡椒色，脸部毛稍短。耳小呈V字形，向前边垂下。嘴边长有胡髭。眼大小适中，呈暗色。胸宽深，臀强硬，腹上收。前肢直立，后肢宽阔结实，断尾，擎起', '0', '2021-03-20 16:09:43', '2021-03-20 17:41:11', '0');
INSERT INTO `pet` VALUES ('41', '小柯1', '3', '1', '2021-03-01 00:00:00', '/images/animals/1419fe92-1a2b-474d-b95d-a964fa8ac487_bg.jpg', '0', '0', '雪纳瑞共有三个品种：大型、标准型、小型三种。 原产地为德国。体长等于身高，呈正方形体型。被毛浓密粗硬，毛色有黑色和胡椒色，脸部毛稍短。耳小呈V字形，向前边垂下。嘴边长有胡髭。眼大小适中，呈暗色。胸宽深，臀强硬，腹上收。前肢直立，后肢宽阔结实，断尾，擎起', '0', '2021-03-20 16:15:55', '2021-03-20 17:41:06', '0');
INSERT INTO `pet` VALUES ('42', '小金2', '1', '0', '2021-03-03 00:00:00', '/images/animals/de144e66-d11b-4e0d-9723-4481bd4b14d8_bg.jpg', '0', '0', '雪纳瑞共有三个品种：大型、标准型、小型三种。 原产地为德国。体长等于身高，呈正方形体型。被毛浓密粗硬，毛色有黑色和胡椒色，脸部毛稍短。耳小呈V字形，向前边垂下。嘴边长有胡髭。眼大小适中，呈暗色。胸宽深，臀强硬，腹上收。前肢直立，后肢宽阔结实，断尾，擎起', '0', '2021-03-20 16:24:38', '2021-03-20 17:41:00', '0');
INSERT INTO `pet` VALUES ('43', '小金1', '1', '0', '2021-03-01 00:00:00', '/images/animals/ed40ac52-f5e6-4863-810f-cff6cf9ba996_jinmao.jpg', '0', '0', '金毛寻回犬是最常见的家犬之一，它很容易养，有耐心并且对主人要求不多，只要定期运动，饲喂食物和兽医体检就可以了。它属于匀称、有力、活泼的一个犬种，特征是稳固、身体各部位配合合理，腿既不太长也不笨拙，表情友善，个性热情、机警、自信而且不怕生，性格讨人喜欢。', '0', '2021-03-20 16:33:23', '2021-03-23 16:51:28', '0');
INSERT INTO `pet` VALUES ('44', '小博2', '1', '0', '2021-03-09 00:00:00', '/images/animals/e77c2a47-46aa-4e19-895e-fc75865447c2_d3.jpg', '0', '0', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-20 16:45:11', '2021-03-23 16:32:42', '0');
INSERT INTO `pet` VALUES ('45', '小博3', '1', '0', '2021-03-09 00:00:00', '/images/animals/e8d5eed7-a041-402b-8233-7571111b3066_adoptdog7.jpg', '1', '0', '博美是一种紧凑、短背、活跃的玩赏犬，学名哈多利系博美犬（俗称英系博美犬），是德国狐狸犬的一种，原产德国。它拥有柔软、浓密的底毛和粗硬的皮毛。尾根位置很高，长有浓密饰毛的尾巴卷放在背上。它具有警惕的性格、聪明的表情、轻快的举止和好奇的天性。体型小巧可爱，适合当伴侣犬，白色和棕色的居多。', '1', '2021-03-23 18:06:56', '2021-03-23 18:07:56', '0');

-- ----------------------------
-- Table structure for `type`
-- ----------------------------
DROP TABLE IF EXISTS `type`;
CREATE TABLE `type` (
  `id` int(11) NOT NULL AUTO_INCREMENT,
  `pettype` varchar(100) DEFAULT NULL,
  PRIMARY KEY (`id`)
) ENGINE=InnoDB AUTO_INCREMENT=31 DEFAULT CHARSET=gb2312;

-- ----------------------------
-- Records of type
-- ----------------------------
INSERT INTO `type` VALUES ('1', '金毛');
INSERT INTO `type` VALUES ('2', '泰迪');
INSERT INTO `type` VALUES ('3', '柯基');
INSERT INTO `type` VALUES ('4', '藏獒');
INSERT INTO `type` VALUES ('5', '边牧');
INSERT INTO `type` VALUES ('6', '柴犬');
INSERT INTO `type` VALUES ('7', '吉娃娃');
INSERT INTO `type` VALUES ('8', '贵宾犬');
INSERT INTO `type` VALUES ('9', '哈士奇');
INSERT INTO `type` VALUES ('10', '雪纳瑞');
INSERT INTO `type` VALUES ('11', '博美犬');
INSERT INTO `type` VALUES ('12', '杜宾犬');
INSERT INTO `type` VALUES ('13', '萨摩耶');
INSERT INTO `type` VALUES ('14', '阿拉斯加');
INSERT INTO `type` VALUES ('15', '暹罗猫');
INSERT INTO `type` VALUES ('16', '狸花猫');
INSERT INTO `type` VALUES ('17', '波斯猫');
INSERT INTO `type` VALUES ('18', '缅甸猫');
INSERT INTO `type` VALUES ('19', '雪鞋猫');
INSERT INTO `type` VALUES ('20', '布偶猫');
INSERT INTO `type` VALUES ('21', '孟加拉猫');
INSERT INTO `type` VALUES ('22', '金吉拉猫');
INSERT INTO `type` VALUES ('23', '安哥拉猫');
INSERT INTO `type` VALUES ('24', '美国短毛猫');
INSERT INTO `type` VALUES ('25', '英国短毛猫');
INSERT INTO `type` VALUES ('26', '挪威森林猫');
INSERT INTO `type` VALUES ('27', '土耳其梵猫');
INSERT INTO `type` VALUES ('28', '俄罗斯蓝猫');
INSERT INTO `type` VALUES ('29', '斯芬克斯猫');
INSERT INTO `type` VALUES ('30', '苏格兰折耳猫');

-- ----------------------------
-- Table structure for `user`
-- ----------------------------
DROP TABLE IF EXISTS `user`;
CREATE TABLE `user` (
  `id` int(11) NOT NULL AUTO_INCREMENT COMMENT 'id',
  `username` varchar(20) NOT NULL COMMENT '用户姓名',
  `password` varchar(30) NOT NULL COMMENT '用户密码',
  `realname` varchar(20) DEFAULT NULL COMMENT '真实姓名',
  `sex` varchar(2) DEFAULT NULL COMMENT '性别',
  `age` int(11) DEFAULT NULL COMMENT '年龄',
  `telephone` varchar(20) DEFAULT NULL COMMENT '电话',
  `email` varchar(30) DEFAULT NULL COMMENT 'Email',
  `address` varchar(50) DEFAULT NULL COMMENT '地址',
  `state` int(11) DEFAULT '0' COMMENT '有无领养宠物的经历 0 是没有 1 是由',
  `pid` int(11) DEFAULT '0' COMMENT '领养的宠物id，0未领养',
  `gmt_create` datetime DEFAULT NULL COMMENT '创建时间',
  `gmt_modified` datetime DEFAULT NULL COMMENT '改更时间',
  `is_deleted` int(20) DEFAULT '0' COMMENT '辑逻删除',
  PRIMARY KEY (`id`) USING BTREE
) ENGINE=InnoDB AUTO_INCREMENT=46 DEFAULT CHARSET=utf8 ROW_FORMAT=COMPACT;

-- ----------------------------
-- Records of user
-- ----------------------------
INSERT INTO `user` VALUES ('1', 'user1', '111111', '用户1', '1', '100', '13809182091', '2425549281@qq.com', '湖北武当山', '0', '0', '2021-02-06 10:44:43', '2021-01-29 10:45:10', '0');
INSERT INTO `user` VALUES ('2', 'aaa', '222222', '周芷若', '0', '23', '13908457344', '2425549281@qq.com', '湖北武当山', '1', '1', '2021-02-12 10:44:47', '2021-03-27 23:20:46', '0');
INSERT INTO `user` VALUES ('3', 'bbb', '111111', '张三丰', '1', '45', '13903827601', '2425549281@qq.com', '湖北武当山', '1', '5', '2021-02-21 10:44:54', '2021-02-28 10:45:17', '0');
INSERT INTO `user` VALUES ('5', 'zhaomin', '111111', '赵敏', '0', '23', '13903810621', '2425549281@qq.com', '蒙古科尔沁', '0', '0', '2021-02-05 10:44:51', '2021-02-27 10:45:19', '0');
INSERT INTO `user` VALUES ('8', 'yinsusu', '111111', '殷素素', '0', '35', '13123819301', '2425549281@qq.com', '河南省郑州市', '1', '23', '2021-02-21 10:44:57', '2021-02-20 10:45:23', '0');
INSERT INTO `user` VALUES ('30', 'zhangwuji', '111111', '张无忌', '1', '32', '15797959509', '2425549281@qq.com', '河南省郑州市', '1', '22', '2021-02-21 10:45:00', '2021-02-21 10:45:25', '0');
INSERT INTO `user` VALUES ('31', 'chengkun', '333333', '成昆', '1', '30', '15995566655', '2425549281@qq.com', '河南省安阳市', '1', '25', '2021-02-21 10:45:04', '2021-02-28 10:45:28', '0');
INSERT INTO `user` VALUES ('32', 'meijue', '111111', '灭绝师太', '0', '35', '15756223601', 'miejue@qq,com', '河南省安阳市', '1', '26', '2021-02-22 10:45:07', '2021-02-27 10:45:31', '0');
INSERT INTO `user` VALUES ('33', '123', '111111', '测试0', '0', null, null, null, '河南省安阳市', '1', '27', null, null, '1');
INSERT INTO `user` VALUES ('34', 'ccc', '111111', '测试1', '1', null, null, null, '上海市浦东新区', '1', '28', null, null, '0');
INSERT INTO `user` VALUES ('35', 'ddd', '111111', '测试2', '1', null, null, null, '上海市浦东新区', '1', '29', '2021-03-15 16:51:39', '2021-03-15 16:51:39', '0');
INSERT INTO `user` VALUES ('36', 'eee', '111111', '测试3', '0', null, null, null, null, '1', '30', '2021-03-15 16:54:33', '2021-03-15 17:06:08', '1');
INSERT INTO `user` VALUES ('37', 'fff', '111111', '测试4', '0', '20', '15898885632', '4556@qq.com', '浙江省 杭州市', '0', '0', '2021-03-15 16:57:12', '2021-03-15 22:24:13', '0');
INSERT INTO `user` VALUES ('38', 'ggg', '222222', '测试5', '0', '30', '15998856635', '145565@qq.com00', '浙江省 杭州市', '1', '32', '2021-03-15 17:02:55', '2021-03-16 10:08:29', '0');
INSERT INTO `user` VALUES ('39', 'hhh', '111111', '测试6', '0', null, null, null, '北京市海淀区', '0', '0', '2021-03-15 17:06:21', '2021-03-15 17:11:34', '1');
INSERT INTO `user` VALUES ('40', 'iii', '111111', '测试7', '1', null, null, null, '北京市海淀区', '0', '0', '2021-03-15 17:11:16', '2021-03-15 17:11:34', '1');
INSERT INTO `user` VALUES ('41', 'jjj', '111111', '测试8', '1', null, null, null, '北京市丰台区', '0', '0', '2021-03-16 10:08:59', '2021-03-16 10:09:21', '1');
INSERT INTO `user` VALUES ('42', 'kkk', '111111', '测试9', '0', '200', '15998956650', '5156156@qq.com', '北京市丰台区', '0', '0', '2021-03-16 10:12:20', '2021-03-16 14:32:49', '0');
INSERT INTO `user` VALUES ('43', 'lll', '111111', '测试10', '1', '50', '15998565562', '4458945@qq.com', '北京市丰台区', '0', '0', '2021-03-16 14:41:47', '2021-03-23 18:12:15', '1');
INSERT INTO `user` VALUES ('44', 'mmm', '222222', '测试11', '0', '50', '15998655632', '2151@qq.com', '河南省郑州市', '0', '0', '2021-03-16 14:58:28', '2021-03-23 18:10:08', '1');
INSERT INTO `user` VALUES ('45', 'nnn', '111111', '测试12', '1', '12', '15899668956', '15415@qq.com', '河南省郑州市', '0', '0', '2021-03-16 15:07:04', '2021-03-16 15:08:35', '0');
